{
    "bar.title": "DeskDoc",
    "bar.home": "Home",
    "bar.settings": "Settings",
    "bar.infos": "Guide",
    "bar.start": "Start",
    "bar.stop": "Stop",
    "bar.status": "Status",
    "bar.status.0": "Active",
    "bar.status.1": "Inactive",

    "settings.intro": "This page allows you to control more precisly the behaviour of the app. The configuration is saved locally on your browser. Don't hesitate to save it (via the export button) because it will be lost if you clear the cache.",
    "settings.howto": "Each event can be manually programmed by clicking on the settings icon. The schedule configuration (days and hours) can either be individually set, or unset, which means it will copy the configuration from the Work Hours event. Events can be individually disabled if necessary, as well as whole categories.",
    "settings.predef.title": "PREDEFINED CONFIGURATION",
    "settings.predef.intro": "Click on a pre-defined category to find out more. Warning : applying a pre-defined configuration will overwrite the current one.",
    "settings.detailed.title": "DETAILED CONFIGURATION",
    "settings.detailed.intro": "Click on an event category to expand or reduce it.",
    "settings.config.title": "GLOBAL CONFIGURATION",
    "settings.config.intro": "Save, export, import the configuration as a string of characters.",
    "settings.config.impexreset": "IMPORT / EXPORT",
    "settings.config.impexreset.intro": "This text contains the current configuration. You can download a file containing it, copy it, modify it, and import a specific config of your choice.",
    "settings.config.import": "Import from text",
    "settings.config.reload": "Reload current",
    "settings.config.download": "Download as file",

    "settings.predef.default.title": "Default",
    "settings.predef.minimalistic.title": "Minimalistic",
    "settings.predef.eyehealth.title": "Eye relief",
    "settings.predef.movealot.title": "Move-A-Lot",
    "settings.predef.complete.title": "Complete",

    "dialog.setpredef.default.title": "Default",
    "dialog.setpredef.default.content": "The basic configuration. Balances essential advised exercises, without disturbing too much the work day.",
    "dialog.setpredef.default.button1": "Apply",
    "dialog.setpredef.default.button2": "Cancel",

    "dialog.setpredef.minimalistic.title": "Minimalistic",
    "dialog.setpredef.minimalistic.content": "Minimalistic configuration. Will only remind you of your schedule and breaks, and to take a walk a few times a day.",
    "dialog.setpredef.minimalistic.button1": "Apply",
    "dialog.setpredef.minimalistic.button2": "Cancel",

    "dialog.setpredef.eyehealth.title": "Eye relief",
    "dialog.setpredef.eyehealth.content": "Focused on relaxing your eyes throughout the day, but minimizing physical movement.",
    "dialog.setpredef.eyehealth.button1": "Apply",
    "dialog.setpredef.eyehealth.button2": "Cancel",

    "dialog.setpredef.movealot.title": "Move-A-Lot",
    "dialog.setpredef.movealot.content": "Focused on physical movement. Especially relevant for long-duration desk tasks.",
    "dialog.setpredef.movealot.button1": "Apply",
    "dialog.setpredef.movealot.button2": "Cancel",

    "dialog.setpredef.complete.title": "Complete",
    "dialog.setpredef.complete.content": "Extensive set of body and eye exercises. Can become a bit of a distraction throughout the day, don't hesitate to fine-tune the configuration.",
    "dialog.setpredef.complete.button1": "Apply",
    "dialog.setpredef.complete.button2": "Cancel",

    "dialog.custom.title": "Custom event",
    "dialog.custom.content": "Create a new custom event, and the DeskDoc will remind you at the frequency you choose.",
    "dialog.custom.inputdesc": "Choose a unique name :",
    "dialog.custom.button1": "Create",
    "dialog.custom.button2": "Cancel",

    "dialog.import.title": "Custom event",
    "dialog.import.content": "Create a new custom event, and the DeskDoc will remind you at the frequency you choose.",
    "dialog.import.inputdesc": "Choose a unique name (alphanumeric, - and _ only) :",
    "dialog.import.button1": "Create",
    "dialog.import.button2": "Cancel",

    "dialog.error.custom.empty.title": "Custom event",
    "dialog.error.custom.empty.content": "An error occurred during creation : empty or null name.",
    "dialog.error.custom.empty.button1": "Close",

    "dialog.error.custom.taken.title": "Custom event",
    "dialog.error.custom.taken.content": "This name is already taken by another event, please choose another name.",
    "dialog.error.custom.taken.button1": "Close",

    "dialog.error.import.empty.title": "Import error",
    "dialog.error.import.empty.content": "An error occurred during import : empty or null string. Check the input string, or reset the configuration.",
    "dialog.error.import.empty.button1": "Close",

    "dialog.error.import.unknown.title": "Import error",
    "dialog.error.import.unknown.content": "An unknown error occurred during import. Check the input string, or reset the configuration.",
    "dialog.error.import.unknown.button1": "Close",

    "event.period.desc": "The period is not strictly respected, if two events are scheduled at the same time they will be delayed temporally.",
    "event.period.tab": "Freq.",
    "event.period.every": "Every",
    "event.period.unit": "minutes",
    "event.days.tab": "Days",
    "event.intervals.tab": "Hours",
    "event.sett.unset": "Unset, will adapt to schedule if possible.",
    "event.sett.set": "Set",
    "event.sett.add": "Add",
    "event.sett.clear": "Clear",

    "infohome.intro": "Click on an type of event to learn more about it. More types of exercises might be available in the future.",

    "event.custom.add": "Add custom event",

    "type.SCHEDULE": "Schedule",
    "type.MOVEMENT": "Movement",
    "type.SITTING": "Sitting",
    "type.EYES": "Eye care",
    "type.CUSTOM": "Custom",

    "type.SCHEDULE.desc": "Events in this section allow you to get notifications about your schedule (beginning and end of day, lunch, breaks... You can disable the events if you do not want to get the notifications for these, but the configuration (days and hours) can still be used as a base for the other events.",
    "type.MOVEMENT.desc": "Movement events make you leave your chair for a brief moment, and are essential to fight the effects of long sitting sessions.",
    "type.SITTING.desc": "Sittings events focus on moving your arms and neck, while remaining on your chair.",
    "type.EYES.desc": "Eye care is primordial while working on a screen. These exercises are focused around relaxation for the eyes, as well as stimulation of the field of view and focus.",
    "type.CUSTOM.desc": "Custom events allow you to define reminders about anything you like.",


    "home.title": "DeskDoc helps you mitigate the effects of desk work on the body",
    "how.title": "How does it work ?",
    "home.p1": "Nowadays, more and more people work in front of a computer all day, sitting down. This has significant impacts on the body, on different levels.",
    "home.p2": "Fortunately, a few exercises done periodically during the day, can help release the accumulated tension and reduce the effects of the prolonged sitting position.",
    "home.p3": "DeskDoc is a free tool that reminds you to periodically take a walk, look at a distant object, wiggle your hands... The tool is fully customizable.",
    "home.p4": "DeskDoc uses browser notifications, don't forget to activate them ! Periodically, the tool will display notifications according to several types of events (schedule, breaks, exercises...). If needed, you can globally disable the tool using the switch in the toolbar (ON/OFF).",
    "home.p5": "The settings menu allows you to fine-tune the tool to your taste. Every event can be individually configured (frequency, hours of the day, days of the week) and disabled. The configuration is stored on the browser storage, no data is collected by this tool at all.",
    "home.p6": "Here are the types of events supported : ",
    "home.SCHEDULE": "Schedule related events :",
    "home.MOVEMENT": "Standing exercises :",
    "home.SITTING": "Sitting exercises :",
    "home.EYES": "Eyesight related exercises :",
    "home.CUSTOM": "Custom exercises :",
    "home.end": "Made by Sam L. Any feedback is welcome on https://github.com/orosens/orosens.github.io.",

    "notifs.not.enabled": "Browser notifications seem to be disabled for the website. Make sure they are activated, and reload the page.",
    "page.reload": "Reload",

    "event.workhours": "Work hours",
    "event.lunch": "Lunch",
    "event.break": "Breaks",
    "event.walk": "Walk",
    "event.stretch": "Stretching",
    "event.squat": "Squats",
    "event.jump": "Jumps",
    "event.legstretch": "Leg stretch",
    "event.handstretch": "Hand stretch",
    "event.wiggle": "Wrist shake",
    "event.neckroll": "Neck roll",
    "event.202020": "20-20-20",
    "event.palming": "Palming",
    "event.swing": "Head swing",
    "event.focus": "Focus change",
    "event.roll": "Eye roll",

    "event.workhours.desc": "A reminder of your working day's beginning and end.",
    "event.lunch.desc": "A reminder of your lunch break.",
    "event.break.desc": "A reminder of your break(s), you can schedule as many as you need.",
    "event.walk.desc": "The most basic exercise, get up from your chair and walk for a moment. ",
    "event.stretch.desc": "Stretching relaxes the tense muscles, especially after a long period of sitting.",
    "event.squat.desc": "Doing a few squats gets the blood flowing.",
    "event.jump.desc": "Jumping in place for a few seconds is also a great way to counteract stress.",
    "event.legstretch.desc": "For very long sessions of sitting, stretching your legs is recommended.",
    "event.handstretch.desc": "Stretching your hands once in a while is advised.",
    "event.wiggle.desc": "Especially useful when using a keyboard for long periods of time.",
    "event.neckroll.desc": "Helps relax the neck muscles and release tension.",
    "event.202020.desc": "Every 20 minutes, look at an object 20 meters away for 20 seconds.",
    "event.palming.desc": "A very easy and quick way to help relieve tension on your eyes.",
    "event.swing.desc": "Especially recommended for long sessions of screen staring.",
    "event.focus.desc": "A classic eyesight exercise, pushes the eyes to change focus.",
    "event.roll.desc": "Helps relieve the ocular tension accumulated.",

    "event.workhours.more": "You can disable the notifications of start and end of day. The configuration of this event (days and hours) can still be used as a base for the other events, event if it is disabled. Events with unset days and hours will inherit this configuration, meaning they will only be effective during the days and hours specified here.",
    "event.lunch.more": "Just like the work hours, the lunch reminder can be disabled if you don't want the notification. You can still define a lunch period during which the other events will not be active.",
    "event.break.more": "Like work hours and lunch, break notifications can be disabled if needed. Other events will not be active during breaks, even if the break notifications are disabled.",
    "event.walk.more": "Getting up and walking should be done every half hour or so. The walk itself doesn't need to be very long, 30 seconds is sufficient.",
    "event.stretch.more": "Stretching relaxes the tense muscles, especially after a long period of sitting. Get up, put your hands on your waist, and do 10 rotations in each direction.",
    "event.squat.more": "Squats are a very good exercise to wake up the legs after a long session of sitting. You don't need to do many squats, just a few (5-10) will do the trick.",
    "event.jump.more": "Get up from your chair, and do 10 small jumps in place. If you want, you can stretch a little afterwards.",
    "event.legstretch.more": "Get up from your chair, extend one leg in front of you, bend the knee, and try to get as low as you can while keeping the other leg straight. Repeat with the other leg.",
    "event.handstretch.more": "Stretching your hands once in a while is advised.",
    "event.wiggle.more": "Relax your arms and let them dangle. Keep your arms and hands relaxes, and gently wiggle them for 15 seconds.",
    "event.neckroll.more": "Sit back in your chair, close your eyes, and roll your neck slowly, 10 times in each direction.",
    "event.202020.more": "The title is explicit for this one. It is an excellent exercise to focus the tension on the eye. The object doesn't need to be 20 meters away exactly, it can be further away. For small spaces, without windows, just pick the furthest object in your surroundings.",
    "event.palming.more": "Cup your hands, and cover your eyes while keeping them open. Your eyes must not touch your hands. Once you create a perfectly (or almost) dark area, relax your eyes, stare in the darkness and move them if you want, for 60 seconds.",
    "event.swing.more": "Look directly in front of you, and swing gently your head from side to side, sweeping the room with your gaze. You can do 10 sweeps.",
    "event.focus.more": "Cover one of your eyes with one hand, and position the thumb of the other hand at 30 cms from your other eye. Slowly, extend your arm, while trying to keep the eye's focus on your thumb. Once the arm is fully extended, bring back the thumb to it's starting position. Do this 5 times for each eye.",
    "event.roll.more": "Close your eyes, and roll slowly and gently your eyes. You can do 5 rotations for each eye.",

    "notif.title.workhours.true": "Start of day",
    "notif.title.workhours.false": "End of day",
    "notif.title.lunch.true": "Start of lunch break",
    "notif.title.lunch.false": "End of lunch break",
    "notif.title.break.true": "Break time",
    "notif.title.break.false": "End of break",
    "notif.title.walk.true": "Walk time !",
    "notif.title.stretch.true": "Stretch time !",
    "notif.title.squat.true": "Squat time !",
    "notif.title.jump.true": "Jump time !",
    "notif.title.legstretch.true": "Leg stretch time !",
    "notif.title.handstretch.true": "Hand stretch time !",
    "notif.title.wiggle.true": "Wrist wiggle time !",
    "notif.title.neckroll.true": "Neck roll time",
    "notif.title.202020.true": "20-20-20 time !",
    "notif.title.palming.true": "Palming time !",
    "notif.title.swing.true": "Head swing time !",
    "notif.title.focus.true": "Focus change time !",
    "notif.title.roll.true": "Eye roll time !",

    "notif.body.workhours.true": "Time to start your work ! We wish you a great day.",
    "notif.body.workhours.false": "Time to sign off ! Have a great evening.",
    "notif.body.lunch.true": "Lunch time ! Bon appétit !",
    "notif.body.lunch.false": "Time to sign back on !",
    "notif.body.break.true": "Take a break !",
    "notif.body.break.false": "Time to sign back on !",
    "notif.body.walk.true": "Take a 30 second walk ! If you can, get outside for a few seconds.",
    "notif.body.stretch.true": "Time to stretch ! Put your hands on your waist and turn 10 times in each direction.",
    "notif.body.squat.true": "Squat time ! Do 5 squats. You can stretch afterwards !",
    "notif.body.jump.true": "Time to jump ! Do 10 small jumps in place. You can stretch afterwards !",
    "notif.body.legstretch.true": "Stretch your legs. Bend a knee, and try to get as low as you can without bending the other knee.",
    "notif.body.handstretch.true": "Stretch your hands in front of you !",
    "notif.body.wiggle.true": "Let your arms dangle, and wiggle your wrists for 20 seconds.",
    "notif.body.neckroll.true": "Sit back in your chair and roll your neck slowly 5 times in each direction.",
    "notif.body.202020.true": "Unfocus from your screen, and look at an object roughly 20 meters away, for 20 seconds.",
    "notif.body.palming.true": "Cover your eyes with your hands without touching them. Open your eyes and let them focus in the dark for 30 seconds.",
    "notif.body.swing.true": "Look directly in front of you, and swing your head from side to side 10 times.",
    "notif.body.focus.true": "Cover one of your eyes with one hand, and move your thumb back and forth, changing focus with your eye.",
    "notif.body.roll.true": "Close your eyes and roll them 5 times in each direction.",

    "event.more.button": "More...",
    "event.less.button": "Less..."
}